{
  "episode_number": 1,
  "analysis": {
    "conflict": "Jack Miller, a dream thief, barely escapes a failed mission in Tokyo where the target's subconscious defenses nearly trap him. Back in New York, he's approached by the mysterious Cobb with an impossible offer: implant an idea in billionaire Robert Fischer's mind in exchange for clearing Jack's criminal record. Jack must decide whether to risk an unprecedented three-layer dream mission while haunted by visions of his deceased wife Emma.",
    "characters": "Jack Miller: A skilled dream thief with a haunted past, motivated by guilt over his wife's death and the chance to erase his criminal record.\nCobb: A mysterious employer with unknown motives, offering Jack a life-changing deal.\nArthur: Jack's reliable partner and dream architect, concerned about the mission's risks.\nEmma: Jack's deceased wife who appears in his subconscious, representing his unresolved trauma."
  },
  "scripts": {
    "english": "## Episode 1: The Dream Thief\n\n**Scene 1: Tokyo Hotel Room - Night**\n(EXTREME CLOSE-UP on Jack's eyes snapping open. He gasps, drenched in sweat. Camera pulls back to reveal him strapped to a chair, wires connected to his temples. A Japanese businessman lies unconscious nearby. Jack rips the wires off, his hands shaking.)\n\nJACK\n(Whispering)\nToo close... way too close.\n\n(He grabs a small metal top from his pocket, spins it on the table. It wobbles, almost falls, then stabilizes. Jack exhales in relief. His phone buzzes with a message: \"Get out. Now.\")\n\n**Scene 2: New York Apartment - Day**\n(Jack stares at a photo of Emma on his wall. He's packing a bag when his doorbell rings. Through the peephole: a well-dressed man in a trench coat - COBB.)\n\nCOBB\n(Voice through door)\nI know about Tokyo. And I know what you really want.\n\n(Jack opens the door cautiously. Cobb enters without invitation, placing a folder on the table.)\n\nCOBB\nRobert Fischer. Youngest billionaire in America. His father's company controls half the tech market.\n\nJACK\nWhat's the job?\n\nCOBB\n(Leans forward)\nNot extraction. Implantation. We need to plant an idea in his subconscious: that his father wanted him to dissolve the company.\n\nJACK\nThat's impossible. You can't implant an idea that deeply.\n\nCOBB\nThree layers. Deepest dream penetration ever attempted. Do this, and every charge against you disappears. Clean slate.\n\n(Jack's eyes flick to Emma's photo. Cobb notices.)\n\nCOBB\nI can give you what money can't buy: freedom from your past.\n\n**Scene 3: Rooftop Bar - Evening**\n(Jack meets with ARTHUR, his longtime partner. Rain falls around the covered rooftop.)\n\nARTHUR\nThree layers? Jack, that's suicide. The subconscious defenses alone...\n\nJACK\nCobb can wipe my record clean. No more running.\n\nARTHUR\nAnd what about Emma? Every time we go deep, she's there. In Tokyo, I saw her in the peripheral data.\n\n(Jack flinches. A waitress approaches - it's EVE, their usual chemist. She slides a drink to Jack.)\n\nEVE\nHeard you're planning something stupid. Need a new sedative formula?\n\nJACK\nSomething that can sustain three layers. Without the usual... side effects.\n\nEVE\n(Smiles darkly)\nI've been working on something. But it's untested. One wrong dose, and you're dreaming forever.\n\n**Scene 4: Jack's Apartment - Night**\n(Jack studies Robert Fischer's file. Photos, business deals, family history. He pauses on a picture of Robert with his elderly father. His phone rings - Cobb.)\n\nCOBB (V.O.)\nTime's running out. Fischer's announcing his corporate strategy next week. We need to move in 48 hours.\n\nJACK\nI need more time to prepare the team.\n\nCOBB\nYou have 24. Or the deal disappears. And so does your chance at freedom.\n\n(Line goes dead. Jack rubs his temples, exhausted. He lies down, closes his eyes. As he drifts off, the room distorts slightly. A shadow moves in the corner.)\n\nEMMA (V.O.)\n(Whispering, distorted)\nYou can't outrun me, Jack...\n\n(Jack's eyes snap open. He's alone. But on the wall, where Emma's photo was, there's now a crack in the plaster shaped like a spiral.)",
    "chinese": "## 第 1 集：梦境窃贼\n\n**场景 1: 东京酒店房间 - 夜晚**\n(极端特写杰克猛然睁开的眼睛。他大口喘气，浑身湿透。镜头拉远，显示他被绑在椅子上，太阳穴连接着电线。一名日本商人昏迷在旁边。杰克扯掉电线，双手颤抖。)\n\n杰克\n(低语)\n太险了...差一点就完了。\n\n(他从口袋掏出一个小金属陀螺，在桌上旋转。陀螺摇晃，几乎倒下，然后稳定下来。杰克松了口气。手机震动，消息显示：“快撤。立刻。”)\n\n**场景 2: 纽约公寓 - 白天**\n(杰克盯着墙上艾玛的照片。他正在收拾行李时门铃响起。通过猫眼：一个穿着风衣的体面男人——科布。)\n\n科布\n(透过门的声音)\n我知道东京的事。我也知道你真正想要什么。\n\n(杰克谨慎地开门。科布未经邀请就走进来，把文件夹放在桌上。)\n\n科布\n罗伯特·费舍尔。美国最年轻的亿万富翁。他父亲的公司控制着半个科技市场。\n\n杰克\n什么任务？\n\n科布\n(身体前倾)\n不是窃取。是植入。我们需要在他潜意识里种下一个想法：他父亲希望他解散公司。\n\n杰克\n这不可能。你无法植入那么深层的想法。\n\n科布\n三层。史上最深的梦境渗透。完成这个，你所有的犯罪记录都会消失。清白之身。\n\n(杰克的目光瞥向艾玛的照片。科布注意到了。)\n\n科布\n我能给你钱买不到的东西：从过去中解脱的自由。\n\n**场景 3: 屋顶酒吧 - 傍晚**\n(杰克与他的老搭档亚瑟会面。雨点落在有遮盖的屋顶周围。)\n\n亚瑟\n三层？杰克，那是自杀。光是潜意识防御就...\n\n杰克\n科布能清除我的所有记录。不用再逃亡了。\n\n亚瑟\n那艾玛呢？每次我们深入梦境，她都在那里。在东京，我在边缘数据里看到了她。\n\n(杰克退缩了一下。一名女服务员走近——是伊芙，他们常用的药剂师。她递给杰克一杯饮料。)\n\n伊芙\n听说你在计划什么蠢事。需要新的镇静剂配方吗？\n\n杰克\n需要能维持三层的。没有通常的...副作用。\n\n伊芙\n(阴暗地微笑)\n我一直在研究某种东西。但还没测试过。剂量出错，你就会永远困在梦里。\n\n**场景 4: 杰克的公寓 - 夜晚**\n(杰克研究罗伯特·费舍尔的档案。照片、商业交易、家庭历史。他停在一张罗伯特与他年迈父亲的合影上。手机响起——科布。)\n\n科布 (画外音)\n时间不多了。费舍尔下周宣布公司战略。我们需要在48小时内行动。\n\n杰克\n我需要更多时间准备团队。\n\n科布\n你只有24小时。否则交易取消。你获得自由的机会也会消失。\n\n(电话挂断。杰克揉着太阳穴，精疲力尽。他躺下，闭上眼睛。当他逐渐入睡时，房间轻微扭曲。角落里有阴影移动。)\n\n艾玛 (画外音)\n(扭曲的低语)\n你逃不掉的，杰克...\n\n(杰克猛然睁眼。他独自一人。但在墙上，原本艾玛照片的位置，现在出现了一道螺旋形状的裂缝。)"
  },
  "ending": {
    "cliffhanger": "Jack discovers a mysterious spiral-shaped crack on his wall where Emma's photo used to be, suggesting her presence is already invading his reality as he prepares for the dangerous mission.",
    "preview": "Next: The team assembles in a secret warehouse lab as Eve reveals her experimental sedative, but during a test run, Emma's projection appears in Jack's dream, threatening to destroy everything before the mission even begins."
  }
}